// pages/about/us/us.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    md: "# 关于我们\n\n台风来临，城市道路积水为患，而人们出行只能靠猜？\n\n**道路积水信息的不透明，由我们来打破！**\n\n## RainStormServer是谁？\n\n我们是一群热爱技术、乐于奉献的中学生，致力于通过自己的技术，探索并打造适合深圳市的道路内涝积水预警系统。\n\nRainStormServer小组的各位认为，技术不只是酷炫的玩具：它应当为人类的生活与发展做出贡献。我们希望能够打造真正面向公众、透明公开的积水数据开放平台，集预报、实时监测、科普于一身；市民可以随时通过多平台访问我们的服务，免于道路积水的危害\n\n于此，RainStormServer之名正是我们精神的体现：暴风雨当前，我们无所畏惧，以精湛的技术，基于云服务器打造优质的预警服务！\n\n## RainStormServer做了什么？\n\n技术从来都不是单打独斗——互联网时代，RainStormServer小组结合众家之长，利用流体力学建模×智能终端×物联网×云计算×微信小程序，建设全平台高可用的城市内涝预警平台。\n\n目前，我们的服务正在开发测试阶段，预计整体服务于2020年4 - 5月梅雨季节上线，敬请期待！"
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})